CSI API ETABS v1
cPointObj.SetSpring Method
 Assigns coupled springs to a point object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSpring(
	string Name,
	ref double[] K,
	eItemType ItemType = eItemType.Objects,
	bool IsLocalCSys = true,
	bool Replace = false
)
Function SetSpring (
	Name As String,
	ByRef K As Double(),
	Optional ItemType As eItemType = eItemType.Objects,
	Optional IsLocalCSys As Boolean = true,
	Optional Replace As Boolean = false
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim K As Double()
Dim ItemType As eItemType
Dim IsLocalCSys As Boolean
Dim Replace As Boolean
Dim returnValue As Integer
returnValue = instance.SetSpring(Name,
	K, ItemType, IsLocalCSys, Replace)
int SetSpring(
	String^ Name,
	array<double>^% K,
	eItemType ItemType = eItemType::Objects,
	bool IsLocalCSys = true,
	bool Replace = false
)
abstract SetSpring :
        Name : string *
        K : float[] byref *
        ?ItemType : eItemType *
        ?IsLocalCSys : bool *
        ?Replace : bool
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
        let _IsLocalCSys = defaultArg IsLocalCSys true
        let _Replace = defaultArg Replace false
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing point object or group depending on the value of the ItemType item.
K
Type: System.Double[]
 This is an array of six spring stiffness values.
Value(0) = U1 [F/L]
Value(1) = U2 [F/L]
Value(2) = U3 [F/L]
Value(3) = R1 [FL/rad]
Value(4) = R2 [FL/rad]
Value(5) = R3 [FL/rad]
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Object, the spring assignment is made to the point object specified by the Name item.
 If this item is Group, the spring assignment is made to all point objects in the group specified by the Name item.
 If this item is SelectedObjects, the spring assignment is made to all selected point objects and the Name item is ignored.
IsLocalCSys (Optional)
Type: System.Boolean
 If this item is True, the specified spring assignments are in the point object local coordinate system. If it is False, the assignments are in the Global coordinate system.
Replace (Optional)
Type: System.Boolean
 If this item is True, all existing point spring assignments to the specified point object(s) are deleted prior to making the assignment. If it is False, the spring assignments are added to any existing assignments.
Return Value
Type: Int32
 Returns zero if the stiffnesses are successfully assigned, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'assign spring to a point
       ReDim k(5)
       k(2) = 10
       ret = SapModel.PointObj.SetSpring("3", k)
   'get spring values
       ReDim k(5)
       ret = SapModel.PointObj.GetSpring("3", k)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPointObj Interface
ETABSv1 Namespace